{
  "ir_version": "0.1.0",
  "module": {
    "name": "demo",
    "semver": "0.1.0",
    "capabilities": [
      "compute"
    ],
    "functions": [],
    "types": [],
    "toplevel": [
      {
        "kind": "expr",
        "value": {
          "kind": "call",
          "callee": "insert",
          "args": [
            {
              "kind": "lit",
              "value": "\"users\"",
              "type": {
                "kind": "Text"
              }
            },
            {
              "kind": "call",
              "callee": "map",
              "args": [
                {
                  "kind": "lit",
                  "value": "\"id\"",
                  "type": {
                    "kind": "Text"
                  }
                },
                {
                  "kind": "lit",
                  "value": 1,
                  "type": {
                    "kind": "Int"
                  }
                },
                {
                  "kind": "lit",
                  "value": "\"email\"",
                  "type": {
                    "kind": "Text"
                  }
                },
                {
                  "kind": "lit",
                  "value": "\"a@b.com\"",
                  "type": {
                    "kind": "Text"
                  }
                },
                {
                  "kind": "lit",
                  "value": "\"is_admin\"",
                  "type": {
                    "kind": "Text"
                  }
                },
                {
                  "kind": "lit",
                  "value": "false",
                  "type": {
                    "kind": "Bool"
                  }
                }
              ]
            }
          ]
        }
      },
      {
        "kind": "expr",
        "value": {
          "kind": "call",
          "callee": "select",
          "args": [
            {
              "kind": "lit",
              "value": "\"users\"",
              "type": {
                "kind": "Text"
              }
            },
            {
              "kind": "call",
              "callee": "list",
              "args": [
                {
                  "kind": "lit",
                  "value": "\"id\"",
                  "type": {
                    "kind": "Text"
                  }
                },
                {
                  "kind": "lit",
                  "value": "\"email\"",
                  "type": {
                    "kind": "Text"
                  }
                }
              ]
            },
            {
              "kind": "call",
              "callee": "map",
              "args": [
                {
                  "kind": "lit",
                  "value": "\"id\"",
                  "type": {
                    "kind": "Text"
                  }
                },
                {
                  "kind": "var",
                  "name": "id",
                  "type": {
                    "kind": "Int"
                  }
                }
              ]
            }
          ]
        }
      },
      {
        "kind": "expr",
        "value": {
          "kind": "call",
          "callee": "update",
          "args": [
            {
              "kind": "lit",
              "value": "\"users\"",
              "type": {
                "kind": "Text"
              }
            },
            {
              "kind": "call",
              "callee": "map",
              "args": [
                {
                  "kind": "lit",
                  "value": "\"email\"",
                  "type": {
                    "kind": "Text"
                  }
                },
                {
                  "kind": "var",
                  "name": "email",
                  "type": {
                    "kind": "Text"
                  }
                }
              ]
            },
            {
              "kind": "call",
              "callee": "map",
              "args": [
                {
                  "kind": "lit",
                  "value": "\"id\"",
                  "type": {
                    "kind": "Text"
                  }
                },
                {
                  "kind": "var",
                  "name": "id",
                  "type": {
                    "kind": "Int"
                  }
                }
              ]
            }
          ]
        }
      },
      {
        "kind": "expr",
        "value": {
          "kind": "call",
          "callee": "delete",
          "args": [
            {
              "kind": "lit",
              "value": "\"users\"",
              "type": {
                "kind": "Text"
              }
            },
            {
              "kind": "call",
              "callee": "map",
              "args": [
                {
                  "kind": "lit",
                  "value": "\"id\"",
                  "type": {
                    "kind": "Text"
                  }
                },
                {
                  "kind": "var",
                  "name": "id",
                  "type": {
                    "kind": "Int"
                  }
                }
              ]
            }
          ]
        }
      }
    ]
  }
}
