{
  "ir_version": "0.1.0",
  "origin": {
    "actor": "🤖",
    "ref": "[Lowering][🧬][IR0].module"
  },
  "module": {
    "name": "ge_le",
    "semver": "0.1.0",
    "functions": [],
    "toplevel": [
      {
        "kind": "show",
        "value": {
          "kind": "binary",
          "op": ">=",
          "left": {
            "kind": "lit",
            "value": 3,
            "type": {
              "kind": "Int"
            }
          },
          "right": {
            "kind": "lit",
            "value": 3,
            "type": {
              "kind": "Int"
            }
          }
        },
        "origin": {
          "actor": "👤",
          "ref": "[AST][📤][N1].show"
        },
        "effects": [
          "io.show"
        ],
        "capabilities": [
          "io"
        ]
      },
      {
        "kind": "show",
        "value": {
          "kind": "binary",
          "op": "<=",
          "left": {
            "kind": "lit",
            "value": 2,
            "type": {
              "kind": "Int"
            }
          },
          "right": {
            "kind": "lit",
            "value": 1,
            "type": {
              "kind": "Int"
            }
          }
        },
        "origin": {
          "actor": "👤",
          "ref": "[AST][📤][N2].show"
        },
        "effects": [
          "io.show"
        ],
        "capabilities": [
          "io"
        ]
      }
    ],
    "types": [],
    "capabilities": [
      "io"
    ]
  }
}
