{
  "ir_version": "0.1.0",
  "origin": {
    "actor": "ðŸ¤–",
    "ref": "[Lowering][ðŸ§¬][IR0].module"
  },
  "module": {
    "name": "compare",
    "semver": "0.1.0",
    "functions": [],
    "toplevel": [
      {
        "kind": "assign",
        "name": "x",
        "declared_type": {
          "kind": "Int"
        },
        "value": {
          "kind": "lit",
          "value": 5,
          "type": {
            "kind": "Int"
          }
        },
        "origin": {
          "actor": "ðŸ‘¤",
          "ref": "[AST][ðŸ“][N1].assign"
        },
        "effects": [],
        "capabilities": []
      },
      {
        "kind": "show",
        "value": {
          "kind": "binary",
          "op": ">=",
          "left": {
            "kind": "var",
            "name": "x"
          },
          "right": {
            "kind": "lit",
            "value": 5,
            "type": {
              "kind": "Int"
            }
          }
        },
        "origin": {
          "actor": "ðŸ‘¤",
          "ref": "[AST][ðŸ“¤][N2].show"
        },
        "effects": [
          "io.show"
        ],
        "capabilities": [
          "io"
        ]
      },
      {
        "kind": "show",
        "value": {
          "kind": "binary",
          "op": "<",
          "left": {
            "kind": "var",
            "name": "x"
          },
          "right": {
            "kind": "lit",
            "value": 2,
            "type": {
              "kind": "Int"
            }
          }
        },
        "origin": {
          "actor": "ðŸ‘¤",
          "ref": "[AST][ðŸ“¤][N3].show"
        },
        "effects": [
          "io.show"
        ],
        "capabilities": [
          "io"
        ]
      }
    ],
    "types": [],
    "capabilities": [
      "io"
    ]
  }
}
