{
  "ir_version": "0.1.0",
  "module": {
    "name": "demo",
    "semver": "0.1.0",
    "capabilities": [
      "compute"
    ],
    "functions": [],
    "types": [
      {
        "name": "users",
        "kind": "record",
        "fields": [
          {
            "name": "id",
            "type": {
              "kind": "Int"
            },
            "origin": {
              "actor": "👤",
              "ref": "x"
            }
          },
          {
            "name": "email",
            "type": {
              "kind": "Text"
            },
            "origin": {
              "actor": "👤",
              "ref": "x"
            }
          }
        ],
        "origin": {
          "actor": "👤",
          "ref": "x"
        }
      },
      {
        "name": "orders",
        "kind": "record",
        "fields": [
          {
            "name": "id",
            "type": {
              "kind": "Int"
            },
            "origin": {
              "actor": "👤",
              "ref": "x"
            }
          },
          {
            "name": "user_id",
            "type": {
              "kind": "Int"
            },
            "origin": {
              "actor": "👤",
              "ref": "x"
            }
          },
          {
            "name": "total",
            "type": {
              "kind": "Float"
            },
            "origin": {
              "actor": "👤",
              "ref": "x"
            }
          }
        ],
        "origin": {
          "actor": "👤",
          "ref": "x"
        }
      }
    ],
    "toplevel": []
  }
}
