{
  "ir_version": "0.1.0",
  "module": {
    "name": "html_demo",
    "semver": "0.1.0",
    "capabilities": [
      "io.write"
    ],
    "types": [],
    "functions": [],
    "toplevel": [
      {
        "kind": "show",
        "value": {
          "kind": "lit",
          "value": "\"hello\"",
          "type": {
            "kind": "Text"
          }
        }
      },
      {
        "kind": "show",
        "value": {
          "kind": "lit",
          "value": 3,
          "type": {
            "kind": "Int"
          }
        }
      },
      {
        "kind": "show",
        "value": {
          "kind": "lit",
          "value": "true",
          "type": {
            "kind": "Bool"
          }
        }
      }
    ]
  }
}
