{
  "ir_version": "0.1.0",
  "module": {
    "name": "html_demo",
    "semver": "0.1.0",
    "capabilities": [
      "io.write"
    ],
    "types": [
      {
        "name": "user",
        "kind": "record",
        "fields": [
          {
            "name": "email",
            "type": {
              "kind": "Text"
            },
            "origin": {
              "actor": "👤",
              "ref": "x"
            }
          },
          {
            "name": "age",
            "type": {
              "kind": "Optional",
              "args": [
                {
                  "kind": "Int"
                }
              ]
            },
            "origin": {
              "actor": "👤",
              "ref": "x"
            }
          },
          {
            "name": "is_admin",
            "type": {
              "kind": "Bool"
            },
            "origin": {
              "actor": "👤",
              "ref": "x"
            }
          }
        ],
        "origin": {
          "actor": "👤",
          "ref": "x"
        }
      }
    ],
    "functions": [],
    "toplevel": []
  }
}
