{
  "ir_version": "0.1.0",
  "origin": {
    "actor": "🤖",
    "ref": "[Lowering][🧬][IR0].module"
  },
  "module": {
    "name": "hello",
    "semver": "0.1.0",
    "functions": [],
    "toplevel": [
      {
        "kind": "show",
        "value": {
          "kind": "lit",
          "value": "\"Hello\"",
          "type": {
            "kind": "Text"
          }
        },
        "origin": {
          "actor": "👤",
          "ref": "[AST][📤][N1].show"
        },
        "effects": [
          "io.show"
        ],
        "capabilities": [
          "io"
        ]
      }
    ],
    "types": [],
    "capabilities": [
      "io"
    ]
  }
}
